#1Создать множество.
#2Создать неизменяемое множество.
#3Выполнить операцию объединения созданных множеств.
#4.   Выполнить операцию пересечения созданных множеств.
a = set()
b = set('hello world')
print(a | b)
print(a & b)